// модальное окно которое српшаивает ваше имя, это имя попадает в переменную
// модалко в котором есть только окей 'здраствуйте (ваше имя). ваше имя состоимт (4) букв
//модалка спрашивает вас какое число умножить на кое
// возвести в степень это число и разделить на самое
//если вдруг оно будет не целое надо сразу округлить

let name = prompt('enter your name')

alert( `Здравствуйте, ${name}! Ваше имя состоит из ${name.length} букв.`);

let a = prompt('введите первое число')
let b = prompt('введите второе число')
let total = a * b

let s = Math.pow(total, 2 )
alert(s)
let t = s / total 
alert(t) 

alert(Math.round(b))
